mfurkannargul/stm32-cubeide-rtc-alarm-clock-with-pwm-buzzer/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HourMinus_Pin GPIO_PIN_8
#define HourMinus_GPIO_Port GPIOE
#define HourMinus_EXTI_IRQn EXTI9_5_IRQn
#define AlarmSet_Pin GPIO_PIN_9
#define AlarmSet_GPIO_Port GPIOE
#define AlarmSet_EXTI_IRQn EXTI9_5_IRQn
#define SecondMinus_Pin GPIO_PIN_10
#define SecondMinus_GPIO_Port GPIOE
#define SecondMinus_EXTI_IRQn EXTI15_10_IRQn
#define SecondPlus_Pin GPIO_PIN_11
#define SecondPlus_GPIO_Port GPIOE
#define SecondPlus_EXTI_IRQn EXTI15_10_IRQn
#define MinuteMinus_Pin GPIO_PIN_12
#define MinuteMinus_GPIO_Port GPIOE
#define MinuteMinus_EXTI_IRQn EXTI15_10_IRQn
#define MinutePlus_Pin GPIO_PIN_13
#define MinutePlus_GPIO_Port GPIOE
#define MinutePlus_EXTI_IRQn EXTI15_10_IRQn
#define HourPlus_Pin GPIO_PIN_15
#define HourPlus_GPIO_Port GPIOE
#define HourPlus_EXTI_IRQn EXTI15_10_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
